SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32BG21/Include/efr32bg21_synth.h
/**************************************************************************//**
 * @file
 * @brief EFR32BG21 SYNTH register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2022 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32BG21_SYNTH_H
#define EFR32BG21_SYNTH_H
#define SYNTH_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32BG21_SYNTH SYNTH
 * @{
 * @brief EFR32BG21 SYNTH Register Declaration.
 *****************************************************************************/

/** SYNTH Register Declaration. */
typedef struct {
  __IM uint32_t  IPVERSION;                     /**< IP Version                                         */
  __IOM uint32_t EN;                            /**< Enable peripheral clock to this module             */
  __IM uint32_t  STATUS;                        /**< Frequency Synthesizer Status                       */
  __IOM uint32_t CMD;                           /**< Command Register                                   */
  __IOM uint32_t CTRL;                          /**< Frequency Synthesizer Control register             */
  uint32_t       RESERVED0[6U];                 /**< Reserved for future use                            */
  __IOM uint32_t VCDACCTRL;                     /**< VCDAC Control register                             */
  uint32_t       RESERVED1[1U];                 /**< Reserved for future use                            */
  __IOM uint32_t FREQ;                          /**< Frequency Word                                     */
  __IOM uint32_t IFFREQ;                        /**< IF frequency                                       */
  __IOM uint32_t DIVCTRL;                       /**< Frequency division control                         */
  __IOM uint32_t CHCTRL;                        /**< Frequency Synthesizer Channel Control              */
  __IOM uint32_t CHSP;                          /**< Channel spacing                                    */
  __IOM uint32_t CALOFFSET;                     /**< Calibration offset                                 */
  __IOM uint32_t VCOTUNING;                     /**< VCO Frequency tuning                               */
  uint32_t       RESERVED2[2U];                 /**< Reserved for future use                            */
  __IOM uint32_t VCOGAIN;                       /**< Calibration values for VCO gain                    */
  uint32_t       RESERVED3[7U];                 /**< Reserved for future use                            */
  __IOM uint32_t IF;                            /**< Interrupt Flag Register                            */
  uint32_t       RESERVED4[2U];                 /**< Reserved for future use                            */
  __IOM uint32_t IEN;                           /**< Interrupt Enable Register                          */
  __IOM uint32_t LOCNTCTRL;                     /**< LO Counter Control Register                        */
  __IM uint32_t  LOCNTSTATUS;                   /**< LO Counter Status Register                         */
  __IM uint32_t  LOCNTTARGET;                   /**< LO Counter Target Value                            */
  __IOM uint32_t MMDDENOMINIT;                  /**< Initial Values for MMD Denom                       */
  __IOM uint32_t CHPDACINIT;                    /**< Initial Value for CHP DAC                          */
  __IOM uint32_t LPFCTRL1CAL;                   /**< LPF control register 1 for CAL mode                */
  __IOM uint32_t LPFCTRL1RX;                    /**< LPF control register 1 for RX mode                 */
  __IOM uint32_t LPFCTRL1TX;                    /**< LPF control register 1 for TX mode                 */
  __IOM uint32_t LPFCTRL2RX;                    /**< LPF control register 2 for RX mode                 */
  __IOM uint32_t LPFCTRL2TX;                    /**< LPF control register 2 for TX mode                 */
  __IOM uint32_t DSMCTRLRX;                     /**< DSM Control register for RX mode                   */
  __IOM uint32_t DSMCTRLTX;                     /**< DSM Control register for TX mode                   */
  uint32_t       RESERVED5[978U];               /**< Reserved for future use                            */
  __IM uint32_t  IPVERSION_SET;                 /**< IP Version                                         */
  __IOM uint32_t EN_SET;                        /**< Enable peripheral clock to this module             */
  __IM uint32_t  STATUS_SET;                    /**< Frequency Synthesizer Status                       */
  __IOM uint32_t CMD_SET;                       /**< Command Register                                   */
  __IOM uint32_t CTRL_SET;                      /**< Frequency Synthesizer Control register             */
  uint32_t       RESERVED6[6U];                 /**< Reserved for future use                            */
  __IOM uint32_t VCDACCTRL_SET;                 /**< VCDAC Control register                             */
  uint32_t       RESERVED7[1U];                 /**< Reserved for future use                            */
  __IOM uint32_t FREQ_SET;                      /**< Frequency Word                                     */
  __IOM uint32_t IFFREQ_SET;                    /**< IF frequency                                       */
  __IOM uint32_t DIVCTRL_SET;                   /**< Frequency division control                         */
  __IOM uint32_t CHCTRL_SET;                    /**< Frequency Synthesizer Channel Control              */
  __IOM uint32_t CHSP_SET;                      /**< Channel spacing                                    */
  __IOM uint32_t CALOFFSET_SET;                 /**< Calibration offset                                 */
  __IOM uint32_t VCOTUNING_SET;                 /**< VCO Frequency tuning                               */
  uint32_t       RESERVED8[2U];                 /**< Reserved for future use                            */
  __IOM uint32_t VCOGAIN_SET;                   /**< Calibration values for VCO gain                    */
  uint32_t       RESERVED9[7U];                 /**< Reserved for future use                            */
  __IOM uint32_t IF_SET;                        /**< Interrupt Flag Register                            */
  uint32_t       RESERVED10[2U];                /**< Reserved for future use                            */
  __IOM uint32_t IEN_SET;                       /**< Interrupt Enable Register                          */
  __IOM uint32_t LOCNTCTRL_SET;                 /**< LO Counter Control Register                        */
  __IM uint32_t  LOCNTSTATUS_SET;               /**< LO Counter Status Register                         */
  __IM uint32_t  LOCNTTARGET_SET;               /**< LO Counter Target Value                            */
  __IOM uint32_t MMDDENOMINIT_SET;              /**< Initial Values for MMD Denom                       */
  __IOM uint32_t CHPDACINIT_SET;                /**< Initial Value for CHP DAC                          */
  __IOM uint32_t LPFCTRL1CAL_SET;               /**< LPF control register 1 for CAL mode                */
  __IOM uint32_t LPFCTRL1RX_SET;                /**< LPF control register 1 for RX mode                 */
  __IOM uint32_t LPFCTRL1TX_SET;                /**< LPF control register 1 for TX mode                 */
  __IOM uint32_t LPFCTRL2RX_SET;                /**< LPF control register 2 for RX mode                 */
  __IOM uint32_t LPFCTRL2TX_SET;                /**< LPF control register 2 for TX mode                 */
  __IOM uint32_t DSMCTRLRX_SET;                 /**< DSM Control register for RX mode                   */
  __IOM uint32_t DSMCTRLTX_SET;                 /**< DSM Control register for TX mode                   */
  uint32_t       RESERVED11[978U];              /**< Reserved for future use                            */
  __IM uint32_t  IPVERSION_CLR;                 /**< IP Version                                         */
  __IOM uint32_t EN_CLR;                        /**< Enable peripheral clock to this module             */
  __IM uint32_t  STATUS_CLR;                    /**< Frequency Synthesizer Status                       */
  __IOM uint32_t CMD_CLR;                       /**< Command Register                                   */
  __IOM uint32_t CTRL_CLR;                      /**< Frequency Synthesizer Control register             */
  uint32_t       RESERVED12[6U];                /**< Reserved for future use                            */
  __IOM uint32_t VCDACCTRL_CLR;                 /**< VCDAC Control register                             */
  uint32_t       RESERVED13[1U];                /**< Reserved for future use                            */
  __IOM uint32_t FREQ_CLR;                      /**< Frequency Word                                     */
  __IOM uint32_t IFFREQ_CLR;                    /**< IF frequency                                       */
  __IOM uint32_t DIVCTRL_CLR;                   /**< Frequency division control                         */
  __IOM uint32_t CHCTRL_CLR;                    /**< Frequency Synthesizer Channel Control              */
  __IOM uint32_t CHSP_CLR;                      /**< Channel spacing                                    */
  __IOM uint32_t CALOFFSET_CLR;                 /**< Calibration offset                                 */
  __IOM uint32_t VCOTUNING_CLR;                 /**< VCO Frequency tuning                               */
  uint32_t       RESERVED14[2U];                /**< Reserved for future use                            */
  __IOM uint32_t VCOGAIN_CLR;                   /**< Calibration values for VCO gain                    */
  uint32_t       RESERVED15[7U];                /**< Reserved for future use                            */
  __IOM uint32_t IF_CLR;                        /**< Interrupt Flag Register                            */
  uint32_t       RESERVED16[2U];                /**< Reserved for future use                            */
  __IOM uint32_t IEN_CLR;                       /**< Interrupt Enable Register                          */
  __IOM uint32_t LOCNTCTRL_CLR;                 /**< LO Counter Control Register                        */
  __IM uint32_t  LOCNTSTATUS_CLR;               /**< LO Counter Status Register                         */
  __IM uint32_t  LOCNTTARGET_CLR;               /**< LO Counter Target Value                            */
  __IOM uint32_t MMDDENOMINIT_CLR;              /**< Initial Values for MMD Denom                       */
  __IOM uint32_t CHPDACINIT_CLR;                /**< Initial Value for CHP DAC                          */
  __IOM uint32_t LPFCTRL1CAL_CLR;               /**< LPF control register 1 for CAL mode                */
  __IOM uint32_t LPFCTRL1RX_CLR;                /**< LPF control register 1 for RX mode                 */
  __IOM uint32_t LPFCTRL1TX_CLR;                /**< LPF control register 1 for TX mode                 */
  __IOM uint32_t LPFCTRL2RX_CLR;                /**< LPF control register 2 for RX mode                 */
  __IOM uint32_t LPFCTRL2TX_CLR;                /**< LPF control register 2 for TX mode                 */
  __IOM uint32_t DSMCTRLRX_CLR;                 /**< DSM Control register for RX mode                   */
  __IOM uint32_t DSMCTRLTX_CLR;                 /**< DSM Control register for TX mode                   */
  uint32_t       RESERVED17[978U];              /**< Reserved for future use                            */
  __IM uint32_t  IPVERSION_TGL;                 /**< IP Version                                         */
  __IOM uint32_t EN_TGL;                        /**< Enable peripheral clock to this module             */
  __IM uint32_t  STATUS_TGL;                    /**< Frequency Synthesizer Status                       */
  __IOM uint32_t CMD_TGL;                       /**< Command Register                                   */
  __IOM uint32_t CTRL_TGL;                      /**< Frequency Synthesizer Control register             */
  uint32_t       RESERVED18[6U];                /**< Reserved for future use                            */
  __IOM uint32_t VCDACCTRL_TGL;                 /**< VCDAC Control register                             */
  uint32_t       RESERVED19[1U];                /**< Reserved for future use                            */
  __IOM uint32_t FREQ_TGL;                      /**< Frequency Word                                     */
  __IOM uint32_t IFFREQ_TGL;                    /**< IF frequency                                       */
  __IOM uint32_t DIVCTRL_TGL;                   /**< Frequency division control                         */
  __IOM uint32_t CHCTRL_TGL;                    /**< Frequency Synthesizer Channel Control              */
  __IOM uint32_t CHSP_TGL;                      /**< Channel spacing                                    */
  __IOM uint32_t CALOFFSET_TGL;                 /**< Calibration offset                                 */
  __IOM uint32_t VCOTUNING_TGL;                 /**< VCO Frequency tuning                               */
  uint32_t       RESERVED20[2U];                /**< Reserved for future use                            */
  __IOM uint32_t VCOGAIN_TGL;                   /**< Calibration values for VCO gain                    */
  uint32_t       RESERVED21[7U];                /**< Reserved for future use                            */
  __IOM uint32_t IF_TGL;                        /**< Interrupt Flag Register                            */
  uint32_t       RESERVED22[2U];                /**< Reserved for future use                            */
  __IOM uint32_t IEN_TGL;                       /**< Interrupt Enable Register                          */
  __IOM uint32_t LOCNTCTRL_TGL;                 /**< LO Counter Control Register                        */
  __IM uint32_t  LOCNTSTATUS_TGL;               /**< LO Counter Status Register                         */
  __IM uint32_t  LOCNTTARGET_TGL;               /**< LO Counter Target Value                            */
  __IOM uint32_t MMDDENOMINIT_TGL;              /**< Initial Values for MMD Denom                       */
  __IOM uint32_t CHPDACINIT_TGL;                /**< Initial Value for CHP DAC                          */
  __IOM uint32_t LPFCTRL1CAL_TGL;               /**< LPF control register 1 for CAL mode                */
  __IOM uint32_t LPFCTRL1RX_TGL;                /**< LPF control register 1 for RX mode                 */
  __IOM uint32_t LPFCTRL1TX_TGL;                /**< LPF control register 1 for TX mode                 */
  __IOM uint32_t LPFCTRL2RX_TGL;                /**< LPF control register 2 for RX mode                 */
  __IOM uint32_t LPFCTRL2TX_TGL;                /**< LPF control register 2 for TX mode                 */
  __IOM uint32_t DSMCTRLRX_TGL;                 /**< DSM Control register for RX mode                   */
  __IOM uint32_t DSMCTRLTX_TGL;                 /**< DSM Control register for TX mode                   */
} SYNTH_TypeDef;
/** @} End of group EFR32BG21_SYNTH */

/**************************************************************************//**
 * @addtogroup EFR32BG21_SYNTH
 * @{
 * @defgroup EFR32BG21_SYNTH_BitFields SYNTH Bit Fields
 * @{
 *****************************************************************************/

